Overload List
Name  |   Description
AddBarGeometry(IList Curve )
 Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
AddBarGeometry(CurveLoop)
 Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
 See Also
  RebarCurvesData Class
  RebarCurvesData Members
  Autodesk.Revit.DB.Structure Namespace